{
  "categories": [
    {
      "id": 1,
      "key": "jawami",
      "name": "جوامع الدعاء",
      "icon": "ic_all_inclusive",
      "duas": [
        {
          "id": 1,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ، وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ، أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ، الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ؛ أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ."
        },
        {
          "id": 2,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللهُ بِأَنَّكَ الوَاحِدُ الأَحَدُ، الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُـوبِي، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ."
        },
        {
          "id": 3,
          "text": "اللَّهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَهْدِيكَ، وَنَسْتَغْفِرُكَ وَنَتُوبُ إِلَيْكَ وَنُؤمِنُ بِكَ، وَنَتَوَكَّلُ عَلَيْكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ كُلّهُ، نَشْكُرُكَ وَلا نَكْفُرُكَ، وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ."
        },
        {
          "id": 4,
          "text": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ الجِدَّ بِالكُفَّارِ مُلْحِقٌ."
        },
        {
          "id": 5,
          "text": "اللَّهُمَّ رَبَّنَا أَعِزَّنَا بِالإِسْلامِ، وَأَعِزَّ بِنَا الإسْلامَ، اللَّهُمَّ أَعْلِ بِنَا كَلِمَةَ الإسْلاَمِ، وَارْفَعْ بِنَا رَايَةَ القُرْآنِ."
        },
        {
          "id": 6,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ المَسْأَلَةِ، وَخَيرَ الدُّعَاءِ، وَخَيرَ النَّجَاحِ، وَخَيرَ العَمَلِ، وَخَيرَ الثَّوَابِ، وَخَيرَ الحَيَاةِ، وَخَيرَ المَمَاتِ، وَثَبِّتْنِي، وَثَقِّلْ مَوَازِينِي، وَحَقِّقْ إِيمَانِي، وَارْفَعْ دَرَجَاتِي، وَتَقَبَّلْ صَلاَتِي، وَاغْفِرْ خَطِيئَتِي، وَأَسْأَلُكَ الدَّرَجَاتِ العُلَى مِنَ الجَنَّةِ."
        },
        {
          "id": 7,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ فَوَاتِحَ الخَيرِ، وَخَوَاتِـمَهُ، وَجَوَامِعَهُ، وَأَوَّلَهُ، وَظَاهِرَهُ، وَبَاطِنَهُ، وَالدَّرَجَاتِ العُلَى مِنَ الجَنَّة آمِينَ."
        },
        {
          "id": 8,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الخَيْرِ كُلِّهُ؛ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنْ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ."
        },
        {
          "id": 9,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ محمد، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ بِكَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ محمد."
        },
        {
          "id": 10,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الجَنَّة، وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْراً."
        },
        {
          "id": 11,
          "text": "اللَّهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا تَحُولُ بِهِ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ، وَمِنْ طَاعَتِكَ مَا تُبَلِّغْنَا بِهِ جَنَّتَكَ، وَمِنَ اليَقِينِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا."
        },
        {
          "id": 12,
          "text": "اللَّهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا، وَأَبْصَارِنَا، وَقُوَّاتِنَا مَا أَحْيَيْتَنَا، وَاجْعَلْهُ الوَارِثَ مِنَّا، وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا، وَانْصُرْنَا عَلَى مَنْ عَادَانَا، وَلا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا وَلا تَجْعَلْ الدُّنْيَا أَكْبَرَ هَمِّنَا، وَلا مَبْلَغَ عِلْمِنَا، وَلا تُسَلِّطْ عَلَيْنَا مَنْ لا يَرْحَمْنَا."
        },
        {
          "id": 13,
          "text": "اللَّهُمَّ إِنَّا نَسْألُكَ مُوجِبَاتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ، وَالسَّلامَةَ مِنْ كُلِّ إثْمٍ، وَالغَنِيمَةَ مِنْ كُلِّ بِرِّ، وَالفَوْزَ بِالجَنَّةِ، وَالنَّجَاةَ مِنَ النَّارِ."
        },
        {
          "id": 14,
          "text": "اللَّهُمَّ لا تَدَعْ لَنَا ذَنْبًا إِلاَّ غَفَرْتَهُ، وَلا هَمًّا إِلاَّ فَرَّجْتَهُ، وَلا دَيْنًا إِلاَّ قَضَيْتَهُ، وَلا مَرِيضاً إِلاَّ شَفَيْتَهُ، وَلا مُبْتَلَى إِلاَّ عَافَيْتَهُ، وَلا ضَالاً إِلاَّ هَدَيْتَهُ، وَلا غَائِباً إِلاَّ رَدَدْتَهُ، وَلا مَظْلُوماً إِلاَّ نَصَرْتَهُ، وَلا مَيِّتاً إِلاَّ رَحِمْتَهُ، وَلا حَاجَةً لَنَا فِيهَا صَلاحٌ وَلَكَ فِيهَا رِضاً إِلاَّ قَضَيْتَهَا وَيَسَّرْتَهَا بِفَضْلِكَ يَا أَكْرَمَ الأَكْرَمِينَ."
        },
        {
          "id": 15,
          "text": "اللَّهُمَّ رَبِّ أَعِنِّي وَلا تُعِنْ عَلَيَّ، وَانْصُرْنِي وَلا تَنْصُرْ عَلَيَّ، وَامْكُرْ لِي وَلا تَمْكُرْ عَلَيَّ، وَاهْدِنِي وَيَسِّرِ الهُدَى إِلَيَّ، وَانْصُرْنِي عَلَى مَنْ بَغَى عَلَيَّ."
        },
        {
          "id": 16,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ كُلِّ خَيْرٍ خَزَائِنُهُ بِيَدِكَ، وَأَعُوذُ بِكَ مِنْ كُلِّ شَرٍّ خَزَائِنُهُ بِيَـدِكَ."
        },
        {
          "id": 17,
          "text": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنَ عِبَادَتِكَ."
        },
        {
          "id": 18,
          "text": "اللَّهُمَّ ارْحَمْنِي، فَأَنْتَ خَيْرُ الرَّاحِمِينَ، وَارْزُقْنِي، فَأَنْتَ خَيْرُ الرَّازِقِينَ، وَاغْفِرْ لِي فَأَنْتَ خَيْرُ الغَافِرِينَ، وَانْصُرْنِي، فَأَنْتَ خَيْرُ النَّاصِرِينَ."
        },
        {
          "id": 19,
          "text": "اللَّهُمَّ زِدْنَا وَلا تَنْقُصْنَا، وَأَكْرِمْنَا وَلا تُـهِنَّا، وَأَعْطِنَا وَلا تَحْرِمْنَا، وَآثِرْنَا وَلا تُؤْثِرْ عَلَينَا، وَأَرْضِنَا وَارْضَ عَنَّا."
        },
        {
          "id": 20,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِيشَةً نَقِيَّةً، وَمِيتَةً سَـوِيَّةً، وَمَرَدّاً غَيْرَ مُخْزٍ وَلا فَاضِحٍ."
        },
        {
          "id": 21,
          "text": "اللَّهُمَّ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَى وَالِدَيَّ، وَأَنْ أَعْمَلَ صَالِحَاً تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ."
        },
        {
          "id": 22,
          "text": "اللَّهُمَّ اغْفِرْ لِي، وَاهْدِنِي وَارْزُقْنِي، وَعَافِنِي، أَعُوذُ بِاللهِ مِنْ ضِيقِ المَقَامِ يَوْمَ القِيامَةِ."
        },
        {
          "id": 23,
          "text": "اللَّهُمَّ أَكْرِمْنِي وَلا تُهِنِّي، وَأَعْطِنِي وَلا تَحْرِمْنِي، وَزِدْنِي وَلا تَنْقُصْنِي، وَآثِرْنِي وَلا تُؤْثِرْ عَلَيَّ، وَارْضَ عَنِّي وَأَرْضِنِي."
        },
        {
          "id": 24,
          "text": "اللَّهُمَّ افْتَحْ لَنَا فَتْحاً مُبِيناً، وَاهْدِنَا صِرَاطاً مُسْتَقِيماً، وَانْصُرْنَا نَصْراً عَزِيزاً، وَأَتِمَّ عَلَيْنَا نَعْمَتَكَ، وَأَنْزِلْ فِي قُلُوبِنَا سَكِينَتَكَ، وَانْشُرْ عَلَيْنَا فَضْلَكَ وَرَحْمَتَكَ."
        },
        {
          "id": 25,
          "text": "للَّهُمَّ أَصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ."
        },
        {
          "id": 26,
          "text": "اللَّهُمَّ اجْعَلْ خَيْرَ عُمُرِي أَوَاخِرَهُ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ، وَخَيْرَ أَيَّامِي يَوْمَ لِقَاكَ."
        },
        {
          "id": 27,
          "text": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ."
        },
        {
          "id": 28,
          "text": "اللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَشَرِّ الشَّيْطَانِ وَشِرْكِه."
        },
        {
          "id": 29,
          "text": "اللَّهُمَّ لَكَ الْحَمْدُ كُلُّهُ، اللَّهُمَّ لَا قَابِضَ لِمَا بَسَطْتَ، وَلَا بَاسِطَ لِمَا قَبَضْتَ، وَلَا هَادِيَ لِمَا أَضْلَلْت، وَلَا مُضِلَّ لِمَنْ هَدَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُقَرِّبَ لِمَا بَاعَدْتَ، وَلَا مُبَاعِدَ لِمَا قَرَّبْتَ، اللَّهُمَّ ابْسُطْ عَلَيْنَا مِنْ بَرَكَاتِكَ وَرَحْمَتِكَ وَفَضْلِكَ وَرِزْقِكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ الْمُقِيمَ الَّذِي لَا يَحُولُ وَلَا يَزُولُ، اللَّهُمَّ إِنِّي أَسْأَلُكَ النَّعِيمَ يَوْمَ الْعَيْلَةِ، وَالْأَمْنَ يَوْمَ الْخَوْفِ."
        }
      ]
    },
    {
      "id": 2,
      "key": "maghfirah",
      "name": "الاستغفار والتوبة",
      "icon": "ic_praying",
      "duas": [
        {
          "id": 30,
          "text": "اللَّهُمَّ إِنَّكَ عَفُوٌّ كَرِيمٌ تُحِبُّ العّفْوَ فَاعْفُ عَنِّي."
        },
        {
          "id": 31,
          "text": "اللَّهُمَّ رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ."
        },
        {
          "id": 32,
          "text": "اللَّهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي، وَإِسْرَافِي فِي أَمْرِي، وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي، اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذَلِكَ عِنْدِي."
        },
        {
          "id": 33,
          "text": "اللَّهُمَّ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي."
        },
        {
          "id": 34,
          "text": "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ."
        },
        {
          "id": 35,
          "text": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي، وَاجْبُرْنِي، وَارْفَعْنِي."
        },
        {
          "id": 36,
          "text": "اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ، وَلا تُنْقِصُهُ المَغْفِرَةُ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ، وَهَبْ لَنَا مَالا يُنْقِصُكَ."
        },
        {
          "id": 37,
          "text": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ، دِقَّهُ وَجُلَّهُ، وَأَوَّلَهُ وَآخِرَهَ، وَعَلاَنِيَتَهَ وَسِرَّهُ."
        },
        {
          "id": 38,
          "text": "اللَّهُمَّ إِنَّ ذُنُوبِي عِظَامٌ وَهِي صِغَارٌ فِي جَنْبِ عَفْوِكَ يَا كَرِيمُ، فَاغْفِرْهَا لِي."
        },
        {
          "id": 39,
          "text": "اللَّهُمَّ رَبَّنَا لا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا، رَبَّنَا وَلا تَحْمِلْ عَلَينَا إِصْرَاً كَمَا حَمَلْتَهَ عَلَى الَّذِينَ مِنْ قَبْلِنَا، رَبَّنَا وَلا تُحَمِّلْنَا مَا لا طَاقَةَ لَنَا بِهِ، وَاعْفُ عَنَّا وّاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلانَا فَانْصُرْنَا عَلَى القَوْمِ الكَافِرِينَ."
        },
        {
          "id": 40,
          "text": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَعْلَنْتُ وَمَا أَسْرَرْتُ، وما أنت أعلم به مني، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ لا إِلَهَ إِلاَّ أَنْـتَ."
        },
        {
          "id": 41,
          "text": "اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأَبْرَار."
        },
        {
          "id": 42,
          "text": "اللَّهُمَّ رَبَّنَا اغْفِرْ لَنَا وَلإخْوَانِنَا الَّذِينَ سَبَقُونَا بِالإِيْمَانِ، رَبَّنَا وَسِعْتَ كُلّ شَيءٍ رَحْمَةً وَعِلْماً فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَاب الجَحِيم.ِ"
        },
        {
          "id": 43,
          "text": "اللَّهُمَّ أَقِلْ عَثَرَاتِنَا، وَاغْفِرْ زَلاَّتِنَا، وَكَفِّرْ عَنَّا سَيِّئَاتِنَا، وَتَوَفَّنَا مَعَ الأَبْرَار.ِ"
        },
        {
          "id": 44,
          "text": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ المَشْرِقِ وَالمَغْرِبْ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ بِالمَاءِ وَالثَّلْجِ وَالبَرَدِ، اللَّهُمَّ نَقِّنِي مِنْ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِـنَ الدَّنَس.ِ"
        },
        {
          "id": 45,
          "text": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظلْماً كَثِيراً، وَلا يَغْفِرُ الذُّنُوب إِلاَّ أَنْتَ. فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدَكَ، وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ."
        },
        {
          "id": 46,
          "text": "اللَّهُمَّ لَكَ أَسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيكَ تَوَكَّلْتُ، وَإِلَيكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، أَعُوذُ بِعِزَّتِكَ، لا إِلَهَ إِلاَّ أَنْت."
        },
        {
          "id": 47,
          "text": "رَبِّ اجْعَلْنِي لَكَ شَكَّارًا، لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مِطْوَاعًا، لَكَ مُخْبِتًا إِلَيْكَ أَوَّاهًا مُنِيبًا، رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي وَثَبِّتْ حُجَّتِي وَسَدِّدْ لِسَانِي وَاهْدِ قَلْبِي وَاسْلُلْ سَخِيمَةَ صَدْرِي."
        }
      ]
    },
    {
      "id": 3,
      "key": "guidance",
      "name": "الهداية والثبات",
      "icon": "ic_compass",
      "duas": [
        {
          "id": 48,
          "text": "للَّهُمَّ أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ."
        },
        {
          "id": 49,
          "text": "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا."
        },
        {
          "id": 50,
          "text": "اللَّهُمَّ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلّ شَيءٍ قَدِيرٌ."
        },
        {
          "id": 51,
          "text": "اللَّهُمَّ حَبِّبْ إلَينَا الإيمَانَ وَزَيِّنْهُ فِي قُلُوبِنَا، وَكَرِّهِ إلَينَا الكُفْرَ وَالفُسُوقَ وَالعِصْيَانِ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ."
        },
        {
          "id": 52,
          "text": "اللَّهُمَّ مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ."
        },
        {
          "id": 53,
          "text": "اللَّهُمَّ رَبِّ جِبْرَائِيلَ وَمِيكَائِيلَ، وَإسْرَافِيلَ، فَاطِرَ السَّمَاوَاتِ وَالأَرْضَ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيْهِ يَخْتَلِفُونَ، اهْدِنَا لِمَا اخْتُلِفَ فِيْهِ مِنَ الحَقِّ بِإذْنِكَ، إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيم.ٍ"
        },
        {
          "id": 54,
          "text": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ بَيْنَ يَدَيَّ نُوراً، وَمِنْ خَلْفِي نُوراً، وَمِنْ فَوقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَاجْعَلْ لِي نُوراً، وَأَعْظِمْ لِي نُوراً."
        },
        {
          "id": 55,
          "text": "اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى وَالسَّدَادَ."
        },
        {
          "id": 56,
          "text": "اللَّهُمَّ أَلْهِمْنِي رُشْدِي، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي."
        },
        {
          "id": 57,
          "text": "اللَّهُمَّ اهْدِنِي لأَحْسَنِ الأَخْلاَقِ لا يَهْدِي لأَحْسَنِهَا إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَها لا يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ."
        },
        {
          "id": 58,
          "text": "اللَّهُمَّ كَمَا أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي."
        },
        {
          "id": 59,
          "text": "اللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ وَالأَبْصَارِ، ثَبِّتْ قُلُوبَنَا عَلَى طَاعَتِكَ، وَلا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا، ولا تَفْتِنَّا فِي دِينِنَا، وَاجْعَلْ يَوْمَنَا خَيْراً مِنْ أَمْسِنَا، وَاجْعَلْ غَدَنَا خَيْراً مِنْ يَوْمـِنَا، وَاجْعَلْ خَيْرَ أَعْمَارِنَا أَوَاخِرَهَا، وَخَيْرَ أَعْمَالِنَا خَوَاتِيمَهَا، وَخَيْرَ أَيَّامِنَا يَوْمَ نَلْقَاكَ وَأَنْتَ رَاضٍ عَنَّا."
        },
        {
          "id": 60,
          "text": "للَّهُمَّ إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الأَمْرِ، وَالْعَزِيمَةَ عَلَى الرُّشْدِ، وَأَسْأَلُكَ مُوجِبَاتِ رَحْمَتكَِ، وَعَزَائمَِ مَغْفِرَتكَِ، وَأسَْألَكَُ شُكْرَ نعِْمَتكَِ، وَحُسْنَ عِباَدَتكَِ، وَأسَْألَكَُ قَلْبًا سَلِيمًا، وَلِسَانًا صَادِقًا، وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا تَعْلَمُ، إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ."
        }
      ]
    },
    {
      "id": 4,
      "key": "tahseen",
      "name": "التحصين والتعوذ",
      "icon": "ic_shield",
      "duas": [
        {
          "id": 61,
          "text": "للَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ القَبْرِ، وَمِنْ فِتْنَةِ المَحْيَا وَالمَمَـاتِ، وَمِنْ فِتْنَةِ المَسِيحِ الدَّجَّالِ، وَأَعُوذُ بِكَ مِنَ المَأْثَمِ وَالمَغْرَمِ."
        },
        {
          "id": 62,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَفِتْنَةِ القَبْرِ، وَعَذَابِ القَبْرِ، وَشَرِّ فِتْنَةِ الغِنَى، وَشَرِّ فِتْنَةِ الفَقْرِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ."
        },
        {
          "id": 63,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالمَأْثَمِ وَالمَغْرَمِ."
        },
        {
          "id": 64,
          "text": "اللَّهُمَّ رَبِّ جِبْرَائِيلَ، وَمِيكَائِيلَ، وَرَبِّ إِسْرَافِيلَ، أَعُوذُ بِكَ مِنْ حَرِّ النَّارِ وَمِنْ عَذَابِ القَبْرِ."
        },
        {
          "id": 65,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ وَالبُخْلِ، وَالهَرَمِ وَالقَسْوَةِ، وَالغَفْلَةِ وَالعَيْلَةِ وَالذِّلَّةِ، وَالمَسْكَنَةِ، وَأَعُوذُ بِكَ مِنَ الفَقْرِ وَالكُفْرِ، وَالفُسُوقِ وَالشِّقَاقِ وَالنِّفَاقِ، وَالسُّمْعَةِ وَالرِّيَاءِ، وَأَعُوذُ بِكَ مِنَ الصَّمَمِ وَالبَكَمِ، وَالجُنُونِ، وَالجِذَامِ، وَالبَرَصِ، وَسَيِّئِ الأَسْقَامِ."
        },
        {
          "id": 66,
          "text": "للَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ، وَالجُبْنِ، وَالبُخْلِ، وَالهَرَمِ، وَعَذَابِ القَبْرِ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاَهَا."
        },
        {
          "id": 67,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الأَخْلاَقِ وَالأَعْمَالِ وَالأَهْوَاءِ وَالأَدْوَاءِ."
        },
        {
          "id": 68,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ تُحَسِّنَ فِي لَوَائِحِ العُيُونِ عَلانِيَتِي، وَتُقَبِّحَ فِي خَفِيَّاتِ العُيُونِ سَرِيرَتِي، اللَّهُمَّ كَمَا أَسَأْتُ وَأَحْسَنْتَ إِلَيَّ، فَإِذَا عُدْتُ فُعُدْ عَلَيَّ."
        },
        {
          "id": 69,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ سَمْـعِي، وَمِنْ شَرِّ بَصَــرِي، وَمِنْ شَــرِّ لِسَـانِيْ، وَمِنْ شَرِّ قَـلْـبِي، ومن شـرِّ مَنِيِّي."
        },
        {
          "id": 70,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَقُولَ زُوراً، أَوْ أَغْشَى فُجُوراً، أَوْ أَكُونَ بِكَ مَغْرُوراً."
        },
        {
          "id": 71,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الشِّقَاقِ وَالنِّفَاقِ، وَسُوءِ الأخْلاقِ."
        },
        {
          "id": 72,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَبِكَ مِنْكَ، لا أُحْصِى ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ."
        },
        {
          "id": 73,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ."
        },
        {
          "id": 74,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ يَوْمِ السُّوءِ، وَمِنْ لَيْلَةِ السُّوءِ، وَمِنْ سَاعَةِ السُّوءِ، وَمِنْ صَاحِبِ السُّوءِ، وَمِنْ جَارِ السُّوءِ، فِي دَارِ المُقَامَةِ."
        },
        {
          "id": 75,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ قَلْبٍ لا يَخْشَعُ، وَمِنْ دُعَاءٍ لا يُسْمَعُ، وَمِنْ نَفْسٍ لا تَشْبَعُ، وَمِنْ عِلْمٍ لا يَنْفَعُ، أَعُوذُ بِكَ مِنْ هَؤُلاَءِ الأَرْبَعِ."
        },
        {
          "id": 76,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عُقُوقِ الأَبْنَاءِ، وَمِنْ قَطِيعَةِ الأَقْرِبَاءِ، وَمِنْ جَفْوَةِ الأَحْيَاءِ، وَمِنْ تَغَيُّرِ الأَصْدِقَاءِ، وَمِنْ شَمَاتَةِ الأَعْدَاءِ."
        },
        {
          "id": 77,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أنْ أَزِلَّ أَوْ أُزَلَّ، أَوْ أَضِلَّ أَوْ أُضَلَّ، أَوْ أَظْلِمَ أَوْ أُظْلَمَ، أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ."
        },
        {
          "id": 78,
          "text": "للَّهُمَّ احْفَظْنِي بِالإسْلاَمِ قَائِماً، وَاحْفَظْنِي بِالإِسْلاَمِ قَاعِداً، وَاحْفَظْنِي بِالإِسْلامِ رَاقِداً، وَلاَ تُشْمِتْ بِي عَدُوّاً وَلا حَاسِداً."
        },
        {
          "id": 79,
          "text": "اللَّهُمَّ قِنِي شَرَّ نَفْسِي، وَاعْزِمْ لِي عَلَى أَرْشَدِ أَمْرِي، اللَّهُمَّ اغْفِرْ لِي مَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ وَمَا أَخْطَأْتُ، وَمَا عَمَدْتُ، وَمَا عَلِمْتُ، وَمَا جَهِلُتُ."
        },
        {
          "id": 80,
          "text": "اللَّهُمَّ اسْتُرْ عَوَرَاتِي، وَآمِنْ رَوْعَاتِي، وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي، وَعَنْ يَمِينِي وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي."
        },
        {
          "id": 81,
          "text": "اللَّهُمَّ إنِِّي أَعُوذُ بكَِ مِنَ الْبُخْلِ، وَأَعُوذُ بكَِ مِنَ الْجُبْنِ، وَأَعُوذُ بكَِ أَنْ أُرَدَّ إلَِى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ."
        },
        {
          "id": 82,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكَسَلِ وَالْهَرَمِ وَالْمَأْثَمِ وَالْمَغْرَمِ، وَمِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ، وَمِنْ شَرِّ فِتْنَةِ الْغِنَى، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْفَقْرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، اللَّهُمَّ اغْسِلْ عَنِّي خَطَايَايَ بِمَاءِ الثَّلْجِ وَالْبَرَدِ، وَنَقِّ قَلْبِي مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الْأَبْيَضَ مِنَ الدَّنَسِ، وَبَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ."
        },
        {
          "id": 83,
          "text": "للَّهُمَّ لَكَ أَسْلَمْتُ وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ وَإِلَيْكَ أَنَبْتُ وَبِكَ خَاصَمْتُ، اللَّهُمَّ إِنِّي أَعُوذُ بِعِزَّتِكَ لَا إِلَهَ إِلَّا أَنْتَ أَنْ تُضِلَّنيِ، أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ."
        },
        {
          "id": 84,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ."
        },
        {
          "id": 85,
          "text": "للَّهُمَّ اسْتُرْ عَوْرَاتِي وَآمِنْ رَوْعَاتِي، وَاحْفَظنْيِ مِنْ بيَنِْ يَدَيَّ وَمِنْ خَلْفِي وَعَنْ يَمِينيِ وَعَنْ شِمَاليِ وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي."
        },
        {
          "id": 86,
          "text": "اللَّهُمَّ إنِِّي عَائذٌِ بكَِ مِنْ شَرِّ مَا أَعْطَيْتَنَا وَشَرِّ مَا مَنَعْتَ، اللَّهُمَّ حَبِّبْ إلَِيْنَا الْإِيمَانَ وَزَيِّنْهُ فيِ قُلُوبِنَا، وَكَرِّهْ إِلَيْنَا الْكُفْرَ وَالْفُسُوقَ وَالْعِصْيَانَ، وَاجْعَلْنَا مِنَ الرَّاشِدِينَ، اللَّهُمَّ تَوَفَّنَا مُسْلِمِينَ، وَأَحْيِنَا مُسْلِمِينَ، وَأَلْحِقْنَا بِالصَّالِحِينَ غَيْرَ خَزَايَا وَلَا مَفْتُونِينَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ يُكَذِّبُونَ رُسُلَكَ، وَيَصُدُّونَ عَنْ سَبِيلِكَ، وَاجْعَلْ عَلَيْهِمْ رِجْزَكَ وَعَذَابَكَ، اللَّهُمَّ قَاتِلْ الْكَفَرَةَ الَّذِينَ أُوتُوا الْكِتَابَ إِلَهَ الْحَقِّ."
        }
      ]
    },
    {
      "id": 5,
      "key": "karb_rizq",
      "name": "الكرب والرزق",
      "icon": "ic_plant",
      "duas": [
        {
          "id": 87,
          "text": "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي فِي دَارِي، وَبَارِكْ لِي فِي رِزْقِي."
        },
        {
          "id": 88,
          "text": "اللَّهُمَّ إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاءَ حَزَنِي، وَذَهَابَ هَمِّي."
        },
        {
          "id": 89,
          "text": "اللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنَزِّلَ التَّوْرَاةَ وَالإنْجِيلَ وَالفُرْقَانَ، أَعُوذُ بِكَ مِنْ شَرِّ كُلّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ، اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيءٌ، وَأَنْتَ الظَّاهِرُ فَلَيسَ فَوْقَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الفَقْرِ."
        },
        {
          "id": 90,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَغَلَبَةِ العَدُوِّ، وَشَمَاتَةِ الأَعْدَاءِ."
        },
        {
          "id": 91,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الفَقْرِ وَالقِلَّةِ وَالذِّلَّةِ، وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ."
        },
        {
          "id": 92,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ فِتْنَةِ الغِنَى، وَمِنْ شَرِّ فِتْنَةِ الفَقْرِ."
        },
        {
          "id": 93,
          "text": "اللَّهُمَّ رَحْمَتَكَ أَرْجُو فَلا تَكِلْني إِلى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لا إِلَهَ إِلاَّ أَنْتَ."
        },
        {
          "id": 94,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ وَدَرَكِ الشَّقَاءِ وَسُوءِ الْقَضَاءِ وَشَمَاتَةِ الْأَعْدَاءِ."
        },
        {
          "id": 95,
          "text": "للَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ."
        }
      ]
    },
    {
      "id": 6,
      "key": "knowledge_health",
      "name": "العلم والعافية",
      "icon": "ic_book_health",
      "duas": [
        {
          "id": 96,
          "text": "اللَّهُمَّ أَغْنِنِي بِالعِلْمِ، وَزَيِّنِّي بِالحِلْمِ، وَأَكْرِمْنِي بِالتَّقْوَى، وَجَمِّلْنِي بِالعَافِيَةِ."
        },
        {
          "id": 97,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمَ الخَائِفِينَ مِنْكَ، وَخَوفَ العَالِمِينَ بِكَ، وَيَقِينَ المُتَوَكِّلِينَ عَلَـيْكَ، وَتَوَكُّلَ المُوقِنِينَ بِكَ، وَإِنَابَةَ المُخْبِتِينَ إِلَيْكَ، وَإِخْبَاتَ المُنِيبينَ إِلَيْكَ، وَشُكْرَ الصَّابِرِينَ لَكَ، وَصَبْرَ الشَّاكِـرِينَ لَكَ، وَلَحَاقاً بِالأَحْيَاءِ المَرْزُوقِينَ عِنْدَكَ."
        },
        {
          "id": 98,
          "text": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي، وَعَلِّمْنِي مَا يَنْفَعُنِي، وَزِدْنِي عِلْماً."
        },
        {
          "id": 99,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَأَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ."
        },
        {
          "id": 100,
          "text": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ، وَمِنْ قَلْبٍ لا يَخْشَعُ، وَمِنْ نَفْسٍ لا تَشْبَعُ، وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا."
        },
        {
          "id": 101,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ وَالمُعَافَاةَ فِي الدُّنْيَا وَالآخِرَةِ."
        },
        {
          "id": 102,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الهُدَى، وَالتُّقَى، وَالعَفَافَ وَالغِنَى."
        },
        {
          "id": 103,
          "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعَاً، وَرِزْقاً طَـيِّباً، وَعَمَلاً مُتَقَبَّلاً."
        },
        {
          "id": 104,
          "text": "للَّهُمَّ إِنِّي أَسْأَلُكَ العَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي."
        },
        {
          "id": 105,
          "text": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إلَِهَ إلَِّا أَنْتَ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ، اللَّهُمَّ إنِِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ."
        }
      ]
    },
    {
      "id": 7,
      "key": "salawat",
      "name": "الصلاة على النبي",
      "icon": "ic_madina",
      "duas": [
        {
          "id": 106,
          "text": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللّٰهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيد."
        }
      ]
    }
  ]
}